-- phpMyAdmin SQL Dump
-- version 4.2.7.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: May 26, 2015 at 02:14 PM
-- Server version: 5.6.20
-- PHP Version: 5.5.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `coreconc_magistrates`
--

-- --------------------------------------------------------

--
-- Table structure for table `tbl_faq`
--

CREATE TABLE IF NOT EXISTS `tbl_faq` (
`faq_id` int(10) NOT NULL,
  `faq_category_id` int(10) NOT NULL,
  `faq` text NOT NULL,
  `faq_answer` longtext NOT NULL,
  `faq_answer_demo` text NOT NULL,
  `tag` text NOT NULL,
  `faq_publish_date` date NOT NULL,
  `publish_status` int(2) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=6 ;

--
-- Dumping data for table `tbl_faq`
--

INSERT INTO `tbl_faq` (`faq_id`, `faq_category_id`, `faq`, `faq_answer`, `faq_answer_demo`, `tag`, `faq_publish_date`, `publish_status`) VALUES
(1, 1, 'তথ্য ও যোগাযোগ প্রযুক্তি আইন, ২০০৬?', '৩৷ (১) এই আইন কার্যকর হইবার সংগে সংগে, বাংলাদেশ শ্রমিক কল্যাণ ফাউন্ডেশন নামে একটি ফাইন্ডেশন প্রতিষ্ঠিত হইবে৷(২) ফাউন্ডেশন একটি সংবিধিবদ্ধ সংস্থা হইবে এবং ইহার স্থায়ী ধারাবাহিকতা ও একটি সাধারণ সীলমোহর থাকিবে এবং এই আইনের বিধানাবলী সাপেক্ষে, ইহার স্থাবর ও অস্থাবর উভয় প্রকার সম্পত্তি অর্জন করিবার, অধিকারে রাখিবার ও হস্তান্তর করিবার ক্ষমতা থাকিবে, এবং ফাউন্ডেশন ইহার নামে মামলা দায়ের করিতে পারিবে এবং উক্ত নামে ইহার বিরুদ্ধেও মামলা দায়ের করা যাইবে৷৫৷ ফাউন্ডেশনের কার্যাবলী হইবে নিম্নরূপ, যথাঃ-	(ক)	শ্রমিক ও তাহার পরিবারের কল্যাণ সাধন;	(খ)	শ্রমিক ও তাহার পরিবারের কল্যাণার্থে, বিভিন্ন প্রকার প্রকল্প গ্রহণ ও উহা বাস্তবায়ন;	(গ)	শ্রমিকদের বিশেষতঃ অক্ষম বা অসমর্থ শ্রমিকদের আর্থিক সাহায্য প্রদান;	(ঘ)	অসুস্থ শ্রমিকের চিকিত্সার ব্যবস্থা করা বা আর্থিক সাহায্য প্রদান;	(ঙ)	দূর্ঘটনায় কোন শ্রমিকের মৃত্যু ঘটিলে তাহার পরিবারবর্গকে সাহায্য প্রদান;	(চ)	শ্রমিকের পরিবারের মেধাবী সদস্যকে শিক্ষার জন্য বৃত্তি কিংবা স্টাইপেন্ড প্রদান;	(ছ)	শ্রমিকদের জীবন বীমাকরণের জন্য যৌথ বীমা ব্যবস্থার প্রবর্তন করা এবং এই লক্ষ্যে তহবিল হইতে সংশ্লিষ্ট বীমা প্রতিষ্ঠানকে প্রিমিয়াম পরিশোধ করা;	(জ)	তহবিল পরিচালনা ও প্রশাসনিক উদ্দেশ্যে অন্যান্য প্রয়োজনীয় কার্যক্রম গ্রহণ করা; এবং	(ঝ)	উপরি-উক্ত কার্যাবলী সম্পাদনের জন্য যে কোন প্রয়োজনীয় ব্যবস্থা গ্রহণ এবং এই আইনের উদ্দেশ্য পূরণকল্পে অন্য যে কোন কার্য সম্পাদন৷', '৩৷ (১) এই আইন কার্যকর হইবার সংগে সংগে, বাংলাদেশ শ্রমিক কল্যাণ ফাউন্ডেশন নামে একটি ফাইন্ডেশন প্রতিষ্ঠিত হইবে৷  (২) ফাউন্ডেশন একটি সংবিধিবদ্ধ সংস্থা হইবে এবং ইহার স্থায়ী ধারাবাহিকতা ও একটি সাধারণ সীলমোহর থাকিবে এবং এই আইনের বিধানাবলী সাপেক্ষে, ইহার স্থাবর ও অস্থাবর', '', '2015-05-25', 1),
(2, 1, 'বাংলাদেশ শ্রমিক কল্যাণ ফাউন্ডেশন আইন, ২০০৬?', 'প্রাতিষ্ঠানিক ও অপ্রাতিষ্ঠানিক খাতে নিয়োজিত শ্রমিকদের কল্যাণ সাধনের নিমিত্ত একটি ফাউন্ডেশন প্রতিষ্ঠার উদ্দেশ্যে প্রণীত আইন যেহেতু প্রাতিষ্ঠানিক ও অপ্রাতিষ্ঠানিক খাতে নিয়োজিত শ্রমিকদের কল্যাণ সাধনের নিমিত্ত একটি ফাউন্ডেশন প্রতিষ্ঠা এবং এতদ্‌সংক্রান্ত বিধান প্রণয়ন করা প্রয়োজনীয় ও সমীচীন;সেহেতু এতদ্‌দ্বারা নিম্্নরূপ আইন করা হইলঃ-সংক্ষিপ্ত শিরোনাম, প্রবর্তন ও প্রয়োগ	 	১৷ (১) এই আইন বাংলাদেশ শ্রমিক কল্যাণ ফাউন্ডেশন আইন, ২০০৬ নামে অভিহিত হইবে৷(২) সরকার, সরকারী গেজেটে প্রজ্ঞাপন দ্বারা, যেই তারিখ নির্ধারণ করিবে সেই তারিখে এই আইন কার্যকর হইবে৷(৩) এই আইন সমগ্র বাংলাদেশের প্রাতিষ্ঠানিক ও অপ্রাতিষ্ঠানিক খাতে নিয়োজিত শ্রমিকদের জন্য প্রযোজ্য হইবে৷', 'প্রাতিষ্ঠানিক ও অপ্রাতিষ্ঠানিক খাতে নিয়োজিত শ্রমিকদের কল্যাণ সাধনের নিমিত্ত একটি ফাউন্ডেশন প্রতিষ্ঠার উদ্দেশ্যে প্রণীত আইন   যেহেতু প্রাতিষ্ঠানিক ও অপ্রাতিষ্ঠানিক খাতে নিয়োজিত শ্রমিকদের কল্যাণ সাধনের ', '', '2015-05-25', 1),
(3, 1, 'বাংলাদেশ শ্রমিক কল্যাণ ,মহাপরিচালক', '১১৷ (১) ফাউন্ডেশনের একজন মহাপরিচালক থাকিবেন৷(২) মহাপরিচালক সরকার কর্তৃক নিযুক্ত হইবেন এবং তাহার চাকুরীর শর্তাদি সরকার কর্তৃক স্থিরীকৃত হইবে৷(৩) মহাপরিচালক ফাউন্ডেশনের সার্বক্ষণিক নির্বাহী কর্মকর্তা হইবেন, এবং তিনি-(ক)	বোর্ডের সিদ্ধান্ত বাস্তবায়নের জন্য দায়ী থাকিবেন; এবং(খ)	এই আইনের উদ্দেশ্য পূরণকল্পে বোর্ড কর্তৃক প্রদত্ত দায়িত্ব ও কার্য সম্পাদন করিবেন৷(৪) মহাপরিচালকের পদ শূন্য হইলে, কিংবা অনুপস্থিতি, অসুস্থতা বা অন্য কোন কারণে মহাপরিচালক তাহার দায়িত্ব পালনে অসমর্থ হইলে শূন্যপদে নবনিযুক্ত মহাপরিচালক কার্যভার গ্রহণ না করা পর্যন্ত কিংবা মহাপরিচালক পুনরায় স্বীয় দায়িত্ব পালনে সমর্থ না হওয়া পর্যন্ত সরকার কর্তৃক মনোনীত কোন ব্যক্তি মহাপরিচালকরূপে দায়িত্ব পালন করিবে৷ ', '১১৷ (১) ফাউন্ডেশনের একজন মহাপরিচালক থাকিবেন৷  (২) মহাপরিচালক সরকার কর্তৃক নিযুক্ত হইবেন এবং তাহার চাকুরীর শর্তাদি সরকার কর্তৃক স্থিরীকৃত হইবে৷', '', '2015-05-25', 1),
(4, 1, 'বাংলাদেশ শ্রমিক কল্যাণ ফাউন্ডেশন আইন, মহাপরিচালক .', '১১৷ (১) ফাউন্ডেশনের একজন মহাপরিচালক থাকিবেন৷(২) মহাপরিচালক সরকার কর্তৃক নিযুক্ত হইবেন এবং তাহার চাকুরীর শর্তাদি সরকার কর্তৃক স্থিরীকৃত হইবে৷(৩) মহাপরিচালক ফাউন্ডেশনের সার্বক্ষণিক নির্বাহী কর্মকর্তা হইবেন, এবং তিনি-(ক)	বোর্ডের সিদ্ধান্ত বাস্তবায়নের জন্য দায়ী থাকিবেন; এবং(খ)	এই আইনের উদ্দেশ্য পূরণকল্পে বোর্ড কর্তৃক প্রদত্ত দায়িত্ব ও কার্য সম্পাদন করিবেন৷(৪) মহাপরিচালকের পদ শূন্য হইলে, কিংবা অনুপস্থিতি, অসুস্থতা বা অন্য কোন কারণে মহাপরিচালক তাহার দায়িত্ব পালনে অসমর্থ হইলে শূন্যপদে নবনিযুক্ত মহাপরিচালক কার্যভার গ্রহণ না করা পর্যন্ত কিংবা মহাপরিচালক পুনরায় স্বীয় দায়িত্ব পালনে সমর্থ না হওয়া পর্যন্ত সরকার কর্তৃক মনোনীত কোন ব্যক্তি মহাপরিচালকরূপে দায়িত্ব পালন করিবে৷ ', '১১৷ (১) ফাউন্ডেশনের একজন মহাপরিচালক থাকিবেন৷  (২) মহাপরিচালক সরকার কর্তৃক নিযুক্ত হইবেন এবং তাহার চাকুরীর শর্তাদি সরকার কর্তৃক স্থিরীকৃত হইবে৷', '', '2015-05-25', 1);

-- --------------------------------------------------------

--
-- Table structure for table `tbl_faq_category`
--

CREATE TABLE IF NOT EXISTS `tbl_faq_category` (
`faq_category_id` int(10) NOT NULL,
  `faq_category_name` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=12 ;

--
-- Dumping data for table `tbl_faq_category`
--

INSERT INTO `tbl_faq_category` (`faq_category_id`, `faq_category_name`) VALUES
(1, 'মুদ্রা বহন'),
(2, 'স্বর্ণ বহন'),
(3, 'টিভি বহন'),
(4, 'এলকোহল/লিকার বহন'),
(5, 'শুল্কমুক্ত পণ্য'),
(6, 'শুল্কযুক্ত পণ্য'),
(7, 'যাত্রীর অধিকার ও প্রাপ্য সুবিধা'),
(8, 'যাত্রীর করণীয় ও বর্জনীয় '),
(9, 'এয়ারপোর্ট ও এয়ারলাইন্স তথ্য'),
(10, 'বিবিধ'),
(11, 'অভিযোগ');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_user`
--

CREATE TABLE IF NOT EXISTS `tbl_user` (
`user_id` int(10) NOT NULL,
  `full_name` varchar(50) NOT NULL,
  `user_name` varchar(15) NOT NULL,
  `password` varchar(32) NOT NULL,
  `status` int(1) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Dumping data for table `tbl_user`
--

INSERT INTO `tbl_user` (`user_id`, `full_name`, `user_name`, `password`, `status`) VALUES
(1, 'Tarek Raihan', 'tarek', 'e10adc3949ba59abbe56e057f20f883e', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tbl_faq`
--
ALTER TABLE `tbl_faq`
 ADD PRIMARY KEY (`faq_id`);

--
-- Indexes for table `tbl_faq_category`
--
ALTER TABLE `tbl_faq_category`
 ADD PRIMARY KEY (`faq_category_id`);

--
-- Indexes for table `tbl_user`
--
ALTER TABLE `tbl_user`
 ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tbl_faq`
--
ALTER TABLE `tbl_faq`
MODIFY `faq_id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT for table `tbl_faq_category`
--
ALTER TABLE `tbl_faq_category`
MODIFY `faq_category_id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=12;
--
-- AUTO_INCREMENT for table `tbl_user`
--
ALTER TABLE `tbl_user`
MODIFY `user_id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
